# GetRoomAtPoint Method (XYZ, Phase) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..GetRoomAtPoint Method (XYZ, Phase)
Document Class See Also
---
Gets a room containing the point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Room GetRoomAtPoint(
	XYZ point,
	Phase phase
)
```

Visual Basic
---
```text
Public Function GetRoomAtPoint ( _
	point As XYZ, _
	phase As Phase _
) As Room
```

Visual C++
---
```text
public:
Room^ GetRoomAtPoint(
	XYZ^ point,
	Phase^ phase
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..XYZPoint to be checked.
phase
    Type: Autodesk.Revit.DB..::..PhasePhase in which the room exists.
# ### Return Value
The room containing the point.
# Remarks
If phase is nullNothingnullptra null reference (Nothing in Visual Basic), it will get the room of the last phase.The first one found will be returned. If there is no room containing the point, it returns nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the point is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue. |

# See Also
Document Class
GetRoomAtPoint Overload
Autodesk.Revit.DB Namespace